In [62]:
import pandas as pd
import os
import numpy as np

In [63]:
raw_files = os.listdir("D:\College_Loyalist\AISC1006 - 01_Step_Presentatio\Project\csv data\ourworldindata")
r = raw_files[0]

In [71]:
raw_files

['african-elephants.csv',
 'black-rhinos.csv',
 'indian-rhinos.csv',
 'javan-rhinos.csv',
 'northern-white-rhinos.csv',
 'number-of-asian-elephants.csv',
 'southern-white-rhinos.csv',
 'sumatran-rhinos.csv']

In [64]:
df = pd.read_csv(r)
print(df)

            Entity Code  Year  African Elephant population (AfESG, 2019)
0           Africa  NaN  1500                                   26000000
1           Africa  NaN  1913                                   10000000
2           Africa  NaN  1979                                    1300000
3           Africa  NaN  1995                                     286233
4           Africa  NaN  1998                                     301733
..             ...  ...   ...                                        ...
87  Western Africa  NaN  2015                                      11489
88          Zambia  ZMB  2007                                      16562
89          Zambia  ZMB  2015                                      21967
90        Zimbabwe  ZWE  2007                                      84416
91        Zimbabwe  ZWE  2015                                      82630

[92 rows x 4 columns]

In [72]:
c = df.columns
print(c[0])

Entity

In [66]:
clean_df = df.dropna(axis = 1)

In [67]:
print(clean_df)

            Entity  Year  African Elephant population (AfESG, 2019)
0           Africa  1500                                   26000000
1           Africa  1913                                   10000000
2           Africa  1979                                    1300000
3           Africa  1995                                     286233
4           Africa  1998                                     301733
..             ...   ...                                        ...
87  Western Africa  2015                                      11489
88          Zambia  2007                                      16562
89          Zambia  2015                                      21967
90        Zimbabwe  2007                                      84416
91        Zimbabwe  2015                                      82630

[92 rows x 3 columns]

In [68]:
clean_df.rename(columns = {"Entity":'Country', "African Elephant population (AfESG, 2019)":"Population"}, inplace=True)
clean_df

C:\Users\ravic\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\LocalCache\local-packages\Python39\site-packages\pandas\core\frame.py:5039: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

           Country  Year  Population
0           Africa  1500    26000000
1           Africa  1913    10000000
2           Africa  1979     1300000
3           Africa  1995      286233
4           Africa  1998      301733
..             ...   ...         ...
87  Western Africa  2015       11489
88          Zambia  2007       16562
89          Zambia  2015       21967
90        Zimbabwe  2007       84416
91        Zimbabwe  2015       82630

[92 rows x 3 columns]

In [69]:
clean_df["Animal"] = "Elephant"
clean_df

           Country  Year  Population    Animal
0           Africa  1500    26000000  Elephant
1           Africa  1913    10000000  Elephant
2           Africa  1979     1300000  Elephant
3           Africa  1995      286233  Elephant
4           Africa  1998      301733  Elephant
..             ...   ...         ...       ...
87  Western Africa  2015       11489  Elephant
88          Zambia  2007       16562  Elephant
89          Zambia  2015       21967  Elephant
90        Zimbabwe  2007       84416  Elephant
91        Zimbabwe  2015       82630  Elephant

[92 rows x 4 columns]